cpu_affinity/fio_logs/fuse_base/randread_4k_16.log
randread: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

randread: (groupid=0, jobs=16): err= 0: pid=69902: Thu Oct  9 02:15:03 2025
  read: IOPS=223k, BW=872MiB/s (915MB/s)(16.0GiB/18781msec)
    clat (nsec): min=204, max=3374.8k, avg=68980.99, stdev=70442.08
     lat (nsec): min=218, max=3375.7k, avg=69006.87, stdev=70442.53
    clat percentiles (nsec):
     |  1.00th=[   604],  5.00th=[   716], 10.00th=[   812], 20.00th=[   980],
     | 30.00th=[  1224], 40.00th=[ 27520], 50.00th=[ 71168], 60.00th=[ 86528],
     | 70.00th=[100864], 80.00th=[118272], 90.00th=[150528], 95.00th=[189440],
     | 99.00th=[292864], 99.50th=[342016], 99.90th=[456704], 99.95th=[509952],
     | 99.99th=[651264]
   bw (  KiB/s): min=623144, max=1719047, per=100.00%, avg=907113.33, stdev=14717.48, samples=571
   iops        : min=155786, max=429761, avg=226778.12, stdev=3679.37, samples=571
  lat (nsec)   : 250=0.01%, 500=0.04%, 750=6.71%, 1000=14.16%
  lat (usec)   : 2=13.84%, 4=1.94%, 10=1.32%, 20=1.19%, 50=3.21%
  lat (usec)   : 100=27.06%, 250=28.66%, 500=1.82%, 750=0.05%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=0.72%, sys=6.05%, ctx=5022617, majf=0, minf=160
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=4194304,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=872MiB/s (915MB/s), 872MiB/s-872MiB/s (915MB/s-915MB/s), io=16.0GiB (17.2GB), run=18781-18781msec