cpu_affinity/fio_logs/fuse_base/randwrite_128k_16.log
randwrite: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 16 processes

randwrite: (groupid=0, jobs=16): err= 0: pid=543279: Thu Oct  9 13:25:59 2025
  write: IOPS=7074, BW=884MiB/s (927MB/s)(16.0GiB/18528msec); 0 zone resets
    clat (usec): min=27, max=203043, avg=1056.60, stdev=6447.59
     lat (usec): min=27, max=203048, avg=1059.97, stdev=6447.77
    clat percentiles (usec):
     |  1.00th=[    47],  5.00th=[    73], 10.00th=[    96], 20.00th=[   126],
     | 30.00th=[   145], 40.00th=[   157], 50.00th=[   169], 60.00th=[   184],
     | 70.00th=[   219], 80.00th=[   281], 90.00th=[   351], 95.00th=[   429],
     | 99.00th=[ 41157], 99.50th=[ 46924], 99.90th=[ 65274], 99.95th=[ 69731],
     | 99.99th=[170918]
   bw (  MiB/s): min=  422, max=11015, per=100.00%, avg=1888.24, stdev=155.07, samples=267
   iops        : min= 3378, max=88120, avg=15103.92, stdev=1240.61, samples=267
  lat (usec)   : 50=1.36%, 100=9.81%, 250=63.45%, 500=22.10%, 750=0.74%
  lat (usec)   : 1000=0.12%
  lat (msec)   : 2=0.22%, 4=0.19%, 10=0.11%, 20=0.02%, 50=1.48%
  lat (msec)   : 100=0.39%, 250=0.01%
  cpu          : usr=0.31%, sys=3.82%, ctx=131201, majf=0, minf=149
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,131072,0,16 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=884MiB/s (927MB/s), 884MiB/s-884MiB/s (927MB/s-927MB/s), io=16.0GiB (17.2GB), run=18528-18528msec