cpu_affinity/fio_logs/fuse_base/randwrite_128k_32.log
randwrite: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=psync, iodepth=1
...
fio-3.16
Starting 32 processes

randwrite: (groupid=0, jobs=32): err= 0: pid=104142: Thu Oct  9 02:21:12 2025
  write: IOPS=6715, BW=839MiB/s (880MB/s)(32.0GiB/39037msec); 0 zone resets
    clat (usec): min=23, max=323568, avg=3155.25, stdev=17501.52
     lat (usec): min=24, max=323575, avg=3158.93, stdev=17501.70
    clat percentiles (usec):
     |  1.00th=[    43],  5.00th=[    59], 10.00th=[    71], 20.00th=[    94],
     | 30.00th=[   126], 40.00th=[   161], 50.00th=[   206], 60.00th=[   255],
     | 70.00th=[   285], 80.00th=[   318], 90.00th=[   408], 95.00th=[   562],
     | 99.00th=[101188], 99.50th=[129500], 99.90th=[191890], 99.95th=[202376],
     | 99.99th=[274727]
   bw (  MiB/s): min=  172, max=11052, per=100.00%, avg=1269.34, stdev=53.91, samples=1632
   iops        : min= 1379, max=88413, avg=10152.12, stdev=431.32, samples=1632
  lat (usec)   : 50=2.61%, 100=19.81%, 250=36.33%, 500=35.16%, 750=2.27%
  lat (usec)   : 1000=0.14%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.03%, 20=0.06%, 50=0.85%
  lat (msec)   : 100=1.67%, 250=1.00%, 500=0.01%
  cpu          : usr=0.15%, sys=1.80%, ctx=262393, majf=0, minf=372
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,262144,0,32 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=839MiB/s (880MB/s), 839MiB/s-839MiB/s (880MB/s-880MB/s), io=32.0GiB (34.4GB), run=39037-39037msec